1.1
var1(before) = 5
var2(before) = 5
var1(after) = 5
var2(after) = 5
1.1  objA.methodA จะทำกำรแทนค่ำ var1 = 10 และ var2 = 5 ซึ่งจะทำงานได้แค่ภำยในเมธอดเท่านั้น เมื่อนำค่ำม
ใช้นอกเมธอด จะเป็นค่ำดั้งเดิมก่อนเรียกใช้ เมธอด เพรวะว่าเรำปรินท์เป็นตัวแปรธรรมดา ไม่ใช่ reference variable หรือก็
คือกำรเรียกใช้ฟังก์ชันในอ๊อปเจคนั้น จะทำการก๊อปปี้ตัวแปรของพำรำมิเตอร์ ลงไปในคลำสนั้นเท่ำนั้น ไม่ใช่ตัวแปรนั้นจริงๆ
1.2
var1(before) = 5
var2(before) = 5
var1(after) = 10
var2(after) = 10
1.2 เป็นเมธอดที่จะทำการส่งข้อมูลประเภท อ๊อปเจค โดยภำยในเมธอด จะทำการ assign ค่ำ 10 ให้ทั้ง var1 และ var2 แต่
เนื่องด้วยกำรส่งค่ำเข้ำเมธอด ค่ำของตัวแปรภำยนอกเมธอดจะเปลี่ยนไปด้วย เพรำะว่ำ ตอนเรำเรียกเมธอด เราส่งค่ำเป็นอ๊อป
เจค ซึ่งภำยในอ๊อปเจค ตัวแปรจะถูกเก็บในรูปของ reference variable ท ำให้ ตัวแปรนั้นๆ มีค่ำเปลี่ยนไป ทั้งภายในและนอก
เมธอด